In [1]:
import numpy as np
import pandas as pd

# Task 1: 
Write a series with values [10,8,9,4,5] 

and change the index to ['Rami','Salma','Bayan','Waleed','Layan'] then sort the series two times, the first time by values, and the second time by index.

In [17]:
mySeries = pd.Series([10,8,9,4,5],index=['Rami','Salma','Bayan','Waleed','Layan'])
mySeries

Rami      10
Salma      8
Bayan      9
Waleed     4
Layan      5
dtype: int64

# Task 2:
Create a dataframe from the dictionary

{'Name':['Ahmad, 'Lina','Dina','Saleem','Alia','Ali','Tasneem'],
'Age':[20,21,19,19,22,20,20]
'Major':['AI',None,'Cyber security','Cyber security','AI',None,'Computer science'],
'City': ['Amman','Amman','Al-salt','Irbid,'Amman',None,'Ajloun']}

1- Print the head of the dataframe

2- Print the shape of the dataframe

3- Print the counts of each value in Major column

4-Put the Age column values in a list

5- Check the number of null values in each column

6- Handle the missing 

7-Convert the dataframe to a csv file and open it

In [4]:
dataframe ={'Name':['Ahmad', 'Lina','Dina','Saleem','Alia','Ali','Tasneem'],
'Age':[20,21,19,19,22,20,20],
'Major':['AI',None,'Cyber security','Cyber security','AI',None,'Computer science'],
'City': ['Amman','Amman','Al-salt','Irbid','Amman',None,'Ajloun']}

df = pd.DataFrame(dataframe)

In [6]:
print(df.head(5))
print(df.shape)

     Name  Age           Major     City
0   Ahmad   20              AI    Amman
1    Lina   21            None    Amman
2    Dina   19  Cyber security  Al-salt
3  Saleem   19  Cyber security    Irbid
4    Alia   22              AI    Amman
(7, 4)

In [15]:
df['Major'].count()

5

In [9]:
mylist = [dataframe['Age']]
mylist

list

In [10]:
df.isnull()

    Name    Age  Major   City
0  False  False  False  False
1  False  False   True  False
2  False  False  False  False
3  False  False  False  False
4  False  False  False  False
5  False  False   True   True
6  False  False  False  False

In [11]:
df = df.dropna()

In [12]:
df

      Name  Age             Major     City
0    Ahmad   20                AI    Amman
2     Dina   19    Cyber security  Al-salt
3   Saleem   19    Cyber security    Irbid
4     Alia   22                AI    Amman
6  Tasneem   20  Computer science   Ajloun

In [13]:
df.to_csv("google.csv")